In [2]:
import pandas as pd
import numpy as np

# Create a DataFrame
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
})

print("Original DataFrame:")
df

Original DataFrame:

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  NaN  3.0  3.0
3  4.0  4.0  NaN
4  5.0  5.0  NaN

In [5]:
df.isna().sum().sum()

4

In [14]:
df.isna().count().count()

3

In [15]:
df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  NaN  3.0  3.0
3  4.0  4.0  NaN
4  5.0  5.0  NaN

In [18]:
df.isnull()

       A      B      C
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True
4  False  False   True

In [19]:
df.isna()

       A      B      C
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True
4  False  False   True

In [20]:
df.isnull().sum()

A    1
B    1
C    2
dtype: int64

In [21]:
df.isna().sum()

A    1
B    1
C    2
dtype: int64

In [22]:
df.dropna()

     A    B    C
1  2.0  2.0  2.0

In [23]:
df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  NaN  3.0  3.0
3  4.0  4.0  NaN
4  5.0  5.0  NaN

In [26]:
df.fillna(400)

       A      B      C
0    1.0  400.0    1.0
1    2.0    2.0    2.0
2  400.0    3.0    3.0
3    4.0    4.0  400.0
4    5.0    5.0  400.0

In [27]:
df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  NaN  3.0  3.0
3  4.0  4.0  NaN
4  5.0  5.0  NaN

In [30]:
df.fillna(method = 'ffill')

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  2.0  3.0  3.0
3  4.0  4.0  3.0
4  5.0  5.0  3.0

In [31]:
df.fillna(method = 'bfill')

     A    B    C
0  1.0  2.0  1.0
1  2.0  2.0  2.0
2  4.0  3.0  3.0
3  4.0  4.0  NaN
4  5.0  5.0  NaN

In [32]:
df.replace(np.nan, 20000)

         A        B        C
0      1.0  20000.0      1.0
1      2.0      2.0      2.0
2  20000.0      3.0      3.0
3      4.0      4.0  20000.0
4      5.0      5.0  20000.0

In [33]:
df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  NaN  3.0  3.0
3  4.0  4.0  NaN
4  5.0  5.0  NaN

In [34]:
df.replace(np.nan, 20000, inplace = True)

In [35]:
df

         A        B        C
0      1.0  20000.0      1.0
1      2.0      2.0      2.0
2  20000.0      3.0      3.0
3      4.0      4.0  20000.0
4      5.0      5.0  20000.0

In [38]:
df.replace(np.nan, 30000, inplace = True)

In [37]:
df

         A        B        C
0      1.0  20000.0      1.0
1      2.0      2.0      2.0
2  20000.0      3.0      3.0
3      4.0      4.0  20000.0
4      5.0      5.0  20000.0